CSI API ETABS v1
cDatabaseTables.GetLoadCombinationsSelectedForDisplay Method
 Returns a list of load combinations that are selected for table display.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLoadCombinationsSelectedForDisplay(
	ref int NumberSelectedLoadCombinations,
	ref string[] LoadCombinationList
)
Function GetLoadCombinationsSelectedForDisplay (
	ByRef NumberSelectedLoadCombinations As Integer,
	ByRef LoadCombinationList As String()
) As Integer
Dim instance As cDatabaseTables
Dim NumberSelectedLoadCombinations As Integer
Dim LoadCombinationList As String()
Dim returnValue As Integer
returnValue = instance.GetLoadCombinationsSelectedForDisplay(NumberSelectedLoadCombinations,
	LoadCombinationList)
int GetLoadCombinationsSelectedForDisplay(
	int% NumberSelectedLoadCombinations,
	array<String^>^% LoadCombinationList
)
abstract GetLoadCombinationsSelectedForDisplay :
        NumberSelectedLoadCombinations : int byref *
        LoadCombinationList : string[] byref -> int
Parameters
NumberSelectedLoadCombinations
Type: System.Int32
Returned Item: The number of load combinations selected for table display.
LoadCombinationList
Type: System.String[]
Returned Item: The zero-based list of load combinations selected for table display.
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
Remarks
This list sets the load combinations that are included when displaying analysis results.
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace